advanced/frontend/views/zhaopin/modules/web/controllers/AdminController.php

SELECT * FROM `admin` WHERE `adm_name`='张三'
---
    public function actionLogin(){

        //echo md5('54250');die;
        //echo md5('asfsdg');die;
        if(Yii::$app->request->isGet){
            $this->layout = 'admin';
            return $this->render('login');
        }
        $adm_name = $this->post('adm_name');
        $adm_pwd = $this->post('adm_pwd');
        //echo $login_name;
        if(mb_strlen($adm_name)<3){
            return "<script>alert('用户名或密码不正确');location.href='".Urlservice::buildWebUrl('/admin/login')."'</script>";
        }
        if(strlen($adm_pwd)<3){
            return "<script>alert('密码不正确');location.href='".Urlservice::buildWebUrl('/admin/login')."'</script>";
        }
        $user_info = Admin::find()->where(['adm_name'=>$adm_name])->one();

SELECT * FROM `admin` WHERE adm_id = 6
---
    public function actionAdmin_del(){
        $study=$this->get('study');
        $id= $this->get('adm_id');
        if($study==1){
            $new_id=2;
            $customer = Admin::findOne($id);
            $customer->study = $new_id;
            $common= $customer->save();
            if($common){
                return $this->redirect('/web/admin/index');
            }
        }else {
            $new_id=1;
            $customer = Admin::findOne($id);

SELECT * FROM `admin` WHERE adm_id = 11
---
    public function actionLike(){
        $cookie = $this->get_cookie('user_login');
        list($name,$id)=explode('#',$cookie);
        $admin = new Admin();
        $customers = $admin::find()->where("adm_id = $id")->asArray()->one();