advanced/frontend/views/zhaopin/modules/web/controllers/BrandController.php

    public function actionInfo()
    {
        $cate = new JobCate();
        //查询
        $data = $cate->find()->asArray()->all();
---
SELECT * FROM `job_cate`