advanced/frontend/views/zhaopin/modules/web/controllers/CateController.php

    public function actionInfo()
    {
        $cate = new JobCate();
        //查询
        $data = $cate->find()->asArray()->all();
---
SELECT * FROM `job_cate`

    public function actionCate_del(){
        //接受要删的ID
        $id = $this->get('id');
//            var_dump($id);die;
        //执行删除语句
        $res = \Yii::$app->db->createCommand()->delete('job_cate',"job_cate_id = $id")->execute();
---
INSERT INTO `job_cate` (`job_cate_name`, `parent_id`, `job_cate_sort`) VALUES ('11111', 34, 100)

    public function actionCate_add(){

            $cate = new JobCate();

            if($this->isPost()){
                //接值post传过来的所有值
                $cate_name=\yii::$app->request->post('cate_name');
                $parent_id=\yii::$app->request->post('parent_id');
                $cate_sort=\yii::$app->request->post('cate_sort');
                //执行添加
                $cate->job_cate_name = $cate_name;
                $cate->parent_id = $parent_id;
                $cate->job_cate_sort = $cate_sort;
                $res=$cate->save();
                //判断
                if($res){
                    echo "<script>alert('添加成功');location.href='".Urlservice::buildWebUrl('/cate/info')."'</script>";
                }else{
                    echo "<script>alert('添加失败');location.href='".Urlservice::buildWebUrl('/cate/cate_add')."'</script>";
                };
            }
                //查询
                $data = JobCate::find()->asArray()->all();
---
SELECT * FROM `job_cate`