advanced/frontend/views/zhaopin/modules/web/controllers/MemberController.php

SELECT COUNT(*) FROM `user` WHERE 1=1
SELECT * FROM `user` WHERE 1=1 LIMIT 4
SELECT COUNT(*) FROM `user` WHERE u_name like"%1234567%"
---
    public function actionInfo()
    {
        $u_gender = $this->get('u_gender');
        $u_name = $this->get('u_name');
        $where=[];
        !empty($u_gender) && $where[]='u_gender ='.$u_gender;
        !empty($u_name) && $where[]='u_name like'.'"%'.$u_name.'%"';
        if(!$where)
        {
            $where = '1=1'  ;
        }else{
            $where=implode(' and ',$where);
        }
        //var_dump($where);
        /*$data = \Yii::$app->db->createCommand("select * from user where('')")->queryAll();*/
        $db=User::find()->andwhere($where);
        $count=$db->count();
        $pages = new Pagination(['totalCount' =>$count,'pagesize'=>4]);
        $model=$db->offset($pages->offset)->limit($pages->limit)->asArray()->all();