advanced/frontend/views/zhaopin/modules/m/controllers/CompanyController.php

SELECT * FROM `industy` WHERE `i_id` IN ('1,2,3,5', '1,2,6,13,15')
SELECT * FROM `company_info` LEFT JOIN `region` ON `company_info`.`region_id` = `region`.`r_id` LEFT JOIN `equity` ON `company_info`.`e_id` = `equity`.`e_id`
SELECT `i_name` FROM `industy` WHERE i_id=Array)
---
    public function actionIndex()
    {
        //地区展示
        $region = new region();
        $res = $region->find()->asArray()->all();
        //行业展示
        $Industy = new Industy();
        $reg = $Industy->find()->asArray()->all();
//        var_dump($res);die;

        $data = CompanyInfo::find()->JoinWith(['region', 'equity'])->asArray()->select('*')->all(); //联查
        foreach ($data as $k => $v) {
            $ids=explode(',',$v['b_id']);
            foreach($ids as $key=>$val){
                $arr= Industy::find()->select('i_name')->where('i_id='.$val)->asArray()->one();