advanced/frontend/views/zhaopin/modules/m/controllers/JianliController.php

     public function actionIndex(){
         $common=new JUser();
         $id=1;
         $user_info = $common::find()->where(['j_id'=>$id])->asArray()->one();
---
SELECT * FROM `j_user` WHERE `j_id`=1