advanced/frontend/views/zhaopin/modules/web/controllers/common/BaseWebController.php

SELECT * FROM `admin` WHERE adm_id=11
---
    public function cookieVerify(){
        $cookie_info = $this->get_cookie('user_login');

        if(!$cookie_info){
            return false;
        }
        list($user_info_md5,$adm_id) = explode('#',$cookie_info);
        $user_info = Admin::find()->where('adm_id='.$adm_id)->one();