advanced/frontend/views/zhaopin/modules/web/controllers/common/ComPage.php

INSERT INTO `company` (`c_tel`, `c_email`, `c_name`, `c_pwd`, `c_salf`, `c_settime`) VALUES ('13898989988', '123456789@qq.com', '刘晓东', '123', 'BMs6HgVC6vHKgAF9', '2017-09-15 15:27:13')
---
    public function add_user(array $data){
        if(!$data) return false;
        $data['c_settime']=date('Y-m-d H:i:s');
        $code=\yii::$app->db->createCommand()->insert('company',$data)->execute();